// семинар 1



// задача 1 (является ли число 1 квадратом от числа 2)
/*
Console.Write("input a first :");
int numer1 = Convert.ToInt32(Console.ReadLine());
Console.Write("input a sekond :");
int numer2 = Convert.ToInt32(Console.ReadLine());
int quad2 = numer2*numer2;
if (numer1==quad2)
   Console.Write("Yes!");
else 
   Console.Write("Nou");
*/

// задача2 написать программу которая показывает все целые числа , в промежутке от минус числа numer до числа numer

/*
Console.Write("input numer : ");
int numer = Convert.ToInt32(Console.ReadLine());
int carent = -numer;
while (carent <= numer )
    {
    Console.Write(carent + " " );
    carent = carent + 1 ; } 
*/
// Домашнее задание семинар 1 
// задача первая , напишите программу которая принимает два числа и на выходе выдаёт какое больше а какое меньше

/*
Console.Write("input a first :") ;
int N1 = Convert.ToInt32(Console.ReadLine()) ;
Console.Write("input a sekond :") ;
int N2 = Convert.ToInt32(Console.ReadLine()) ;
if (N1<N2)
   Console.Write(N2);
else
   Console.Write(N1);
*/
// напишите программу которая на вход принимает три числа и выдаёт максимальное из этих чисел
/*Console.Write("Input a frist :");
int N1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a sekond :");
int N2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a Therd :");
int N3 = Convert.ToInt32(Console.ReadLine());

int N4 = N1 ;
if (N1>N4) N4=N1;
if (N2>N4) N4=N2;
if (N3>N4) N4=N3;
Console.Write (N4);
*/
// 3 задача напишите программу которая на вход принимает число и выдаёт является ли число чётным , делится ли оно без остатка
/*
Console.Write("Input a Nr :");
int N1 = Convert.ToInt32(Console.ReadLine());
if  (N1%2==0)
   Console.Write("Yes");
else
   Console.Write("Nou");
*/
// 4 задача напиши программу которая на вход принимает число N , а на выходе показывает все числа от одного до N
/*
Console.Write("input a N :");
int N =Convert.ToInt32(Console.ReadLine());
int carent = 1;
while (carent<=N)
{
    Console.Write(carent + " " );
    carent = carent + 1 ; } ;
 /*





    







